import 'package:flutter/material.dart';
import 'package:pregnant_women/details.dart';

class Home extends StatelessWidget{

  TextEditingController n1 = new TextEditingController();
  TextEditingController n2 = new TextEditingController();
  TextEditingController n11 = new TextEditingController();
  TextEditingController n111 = new TextEditingController();
  TextEditingController n12 = new TextEditingController();
  TextEditingController n112 = new TextEditingController();
  TextEditingController n13 = new TextEditingController();
  TextEditingController n113 = new TextEditingController();

  @override
  Widget build(BuildContext context) {
    // TODO: implement build
    return Scaffold(
      appBar: AppBar(
        elevation: 1.0,
        backgroundColor: Colors.red,
        title: Text(
            "الصفحة الرئيسية",
          style: TextStyle(
            fontWeight: FontWeight.bold,
            fontSize: 20.0,
          ),
        ),
      ),
      body: Center(
        child: ListView(
          scrollDirection: Axis.vertical,
          children: [
            Padding(padding: EdgeInsets.all(50.0)),
            Padding(
              padding: const EdgeInsets.all(25.0),
              child: TextField(
                controller: n1,
                decoration: InputDecoration(
                  border: OutlineInputBorder(borderRadius: BorderRadius.circular(20.0)),
                  label: Text("ادخل رقم الاسبوع", style: TextStyle(fontWeight: FontWeight.w700, fontSize: 20.0),),
                ),
              ),
            ),
            Padding(padding: EdgeInsets.all(25.0)),
            Padding(
              padding: const EdgeInsets.all(25.0),
              child: MaterialButton(
                elevation: 1.0,
                shape: OutlineInputBorder(borderRadius: BorderRadius.circular(20.0)),
                color: Colors.red,
                onPressed: (){
                  String x = n1.text;
                  int a = int.parse(x);
                  n2.text = a.toString();
                  String n11, n12, n13;

                  if (a==1)
                    {
                      n11 = "من الصعب معرفة مراحل تكوين الجنين في الأسبوع الأول من الحمل، هو قد يكون مجرد وميض، وذلك لأن الأطباء يعتقدون أنه من الصعب تحديد إذا كانت المرأة حامل أم هذه أعراض نهاية الدورة الشهرية";
                      n12 = "في هذا الأسبوع يراود البعض هذا التساؤل..إنذار كاذب أم حمل؟، إن كنتِ تحاولين الحمل حديثًا، أو تبحثين عن تحقيق حلم الأمومة منذ فترة، فيحمل الأسبوع الأول من الحمل مفاجأة لكِ، لأن بعض الأطباء يعتبرون أنه ليس هناك حمل على الإطلاق، وتحسب هذه الفترة ضمن آخر أسبوع في الدورة الشهرية، حيث من الصعب تحديد العلامات الجسدية خلال الأسبوع الأول من الحمل";
                      n13 = "يفضل استشارة الطبيب";
                      n111.text = n11;
                      n112.text = n12;
                      n113.text = n13;
                    }
                  else if (a==2)
                  {
                    n11 = "من الصعب اظهار حالة الجنين او مواصفاته ف الشهور الأوليه";
                    n12 = "رغم أن الأعراض مازالت مبكرة، إلا أنك يمكنك الشعور بها وقد تلاحظينها بقوة في بداية الأسبوع الثاني من الحمل، وتتضمن التالي: تورم الثديين-تغير المزاج-القيء أو الغثيان-زيادة التبول-إعياء";
                    n13 = "تساعد هذه النصائح في استكمال مراحل التحضير للحمل، في ذلك الأسبوع، عليكِ القيام ببعض السلوكيات واتباع العادات الصحية المفيدة لكِ، وهي كالتالي: تناول الفيتامينات والمكملات الغذائية الهامة، المفيدة للمرأة الحامل، مثل حمض الفوليك، الذي توصي به مراكز الوقاية من الأمراض والسيطرة عليها، عبر تناول 400 ميكروجرام، هذه الكمية مفيدة لكِ قبل الحمل وأثناء الحمل، حيث يحمي حمض الفوليك من تشوه الأجنة والعيوب الخلقية اتباع نظام غذائي صحي يتضمن جميع العناصر الغذائية التي يحتاجها الجسم التحكم في الوزن، حيث أثبتت الدراسات ان النساء اللائي يعانين من السمنة أو زيادة الوزن المفرطة، هن الأكثر عُرضة للإصابة بالعقم ممارسة التمارين الرياضية بانتظام، تساعد ممارسة الرياضة بانتظام على إنتاج الجسم للهرمونات التي تحتاجينها للحمل، فضلًا عن الفوائد غير المباشرة مثل تحسين الصحة النفسية والمساهمة في إنقاص الوزن الابتعاد عن التوتر والقلق، يساهم القلق الزائد في إفراز هرمونات من شأنها التقليل من فرص الحمل، لذا ينصح أطباء النساء بالابتعاد عن القلق، ومحاولة الاسترخاء، من خلال تمارين التأمل والاسترخاء مثل اليوجا تجنب المشروبات الغازية، تحتوي المشروبات الغازية على كميات مرتفعة من الكافيين، والتي تؤدي إلى تقليل فرص الحمل تجنب القهوة والشاي، نظرًا لأن هذه المشروبات تحتوي على كميات مرتفعة من الكافيين.ليست هذه النصائح خاصة بالأسبوع الثاني من الحمل فقط، لكن مهمة لحياتك واستعداد جسمك للحمل والولادة فيمّا بعد";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==3)
                  {
                    n11 = "خلال الأسبوع الثالث من الحمل، قد لا تكشف الموجات فوق الصوتية (السونار) عن الجنين، نظرًا لأن البويضة المخصبة تكون أصغر من حبة الملح وتتحرك داخل قناة فالوب، وقد يتمكن الطبيب خلال الأسبوع الرابع من الحمل، من رؤية بطانة الرحم تزداد سمكًا، وهي علامة على الحمل";
                    n12 = "في معظم الأحيان لا تظهر علامات الحمل المبكر، وقد لا تشعرين بها، حيث أن الجسم ينتج في تلك الفترة هرمونات الحمل، وربما لا يكون لديكِ مستويات عالية جدًا منها، لكن هناك بعض العلامات والأعراض الخفيفة، والتي تظهر في الأسبوع الثالث، وتتضح في الأسابيع التي تليها، مثل: النزيف: في هذه المرحلة تظهر بعض البقع نتيجة لتحفيز البويضة المخصبة في بطانة الرحم، وهذا يدل على أن هناك جنين بالفعل، لكنه طور التكوين.الغثيان الصباحي: عندما تبدأ هرمونات الحمل في ارتفاع مستوياتها في جسمك، فقد تعبر عن نفسها داخل جسمك بشعورك الغثيان في أي وقت من اليوم، ويكون لديكِ شعورًا سيئًا للغاية لدرجة التقيؤ، وربما هذه العلامة هي أبرز أعراض الحمل، والتي تظهر في الأسابيع أو الشهو الأولى.زيادة مستويات هرمونات الحمل: من المبكرة معرفة نوع الجنين أو حجمه أو إن كان توأمًا أم لا، لكن تشير زيادة مستويات هرمونات الحمل خلال الأسبوع الثالث، إلى احتمالية الحمل بتوأم.الوقت الضائع: والذي يمكنك من خلال اكتشاف حملك، خاصًة إن كانت دورتك الشهرية أقصى مدة لها 28 يومًا، وللتأكد يساعدك إجراء اختبار للحمل على معرفة ذلك.بعد إجراء اختبار منزلي للحمل، والتأكد منه، فقد تكونين متحمسة أكثر لمشاهدة الاختلاف على جدك، مثل اختلاف حجم البطن، إلا أن في الأسبوع الثالث من الحمل قد يكون بطنك منتفخًا قليلًا بشكل لا يمكن ملاحظته حيث لا يبدأ البطن في الانتفاخ والبروز، عند معظم النساء الحوامل، إلا بعد مرور 12 أسبوعًا من الحمل";
                    n13 = "في البداية عليك اجراء بعض التحاليل الطبية فى تلك الفترة – وغالبًا ما يطلبها الطبيب المعالج وهي: صورة دم كاملة-تحليل بول-تحليل للكشف عن الكالسيوم في الجسم.ومنذ تلك اللحظة عليك العمل بتلك النصائح: الاهتمام باتباع نظام غذائي صحي-تناول البروتين لإنتاج أنسجة جديدة خلال فترة الحمل-الاهتمام بالكالسيوم المتوفر بكثرة في منتجات الألبان-الحصول على أقراص حمض الفوليك";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==4)
                  {
                    n11 = "طفلك حالياً يكون عبارة عن مجموعة من الخلايا، التي طلق عليها الكيسة الأريمية، والتي عادًة ما تكون حجمها، حوالي نصف هذه الخلايا تصبح جنينًا بحجم حبة الخشخاش، وذلك بنهاية الأسبوع الرابع، أما النصف الثاني فهو موجود ليحافظ على سلامة الجنين ويساعده في الحصول على غذاء واكتمال النمو.وقد يبدو هذا الحجم في بداية الأسبوع الرابع صغيرًا للغاية، إلا أن الكروموسومات الخاصة بطفلك، قد اتخذت قرارها في تحديد خصائص الطفل مثل لون الشعر ولون العين ونوع الجنس، وأكثر من ذلك.واذا كنتى حامل بتوأم لا يمكن لكِ معرفة خبر الحمل بتوأم في الأسبوع الرابع، من خلال فحص الموجات فوق الصوتية أو السونار، ولكن يمكنك الشعور بأعراض الحمل مضاعفة، وذلك نظرًا لهرمونات الحمل هرمون البروجسترون والهرموانات الموجهة للغدد التناسلية، التي تكون أعلى من معدلاتها الطبيعية خلال الحمل، قد تعطيكي فكرة عما يدور بداخلك";
                    n12 = "الغثيان الصباحي-الإنهاك-كثرة التبول-زيادة الحساسية والشعور بالروائح، مثل النفور من روائح الأطعمة-الرغبة الشديدة في تناول الأطعمة أو النفور منها.يبدأ جسمك في سلسلة من التغيرات بدايًة من الأسبوع الرابع من الحمل، ولمدة الـ 36 أسبوعًا مقبلًا، وواحدة من أهم علامات الحمل، هي زيادة هرمون البروجسترون لديكِ وارتفاع مستوياته عن باقية الهرمونات الأخرى، ليحافظ على حملك";
                    n13 = "عليكِ متابعة الاهتمام بالتغذية الصحية، والحصول على قسطٍ كافٍ من النوم والراحة، إلى جانب هذه النصائح: إذا كنتي تشعرين بألم في الثدي، يمكنك ارتداء حمالة صدر داعمة أثناء النهار، لتخفيف الشعور بالألم يعتبر الغثيان الصباحي غير شائع، خلال الأسابيع الأولى من الحمل، لكن إذا أصيبت به يجب تناول الأطعمة الخفيفة، التي تحتوي على كربوهيدرات وخضروات وفواكه-إذا كنتِ تعانين من كثرة التبول، فأنتِ بحاجة إلى عدم شرب الكثير جدًا من السوائل، مع الحرص على شرب الماء بانتظام لأنك تحتاجين إلى الماء خلال هذه الفترة";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==5)
                  {
                    n11 = "يطلق على الأسبوع الخامس من الحمل، بداية الفترة الجنينية، حيث تبدأ الأجهزة الحيوية، وهيكل جسم طفلك في التكوين مثل القلب والدماغ والحبل الشوكي.في هذه المرحلة ينبض قلب طفلك بمعدل ثابت، وينمو الجنين بسرعة، المشيمة تبدأ في التطور، إلا أنه لا يكون طفل بعد ومازال طور التكوين، ورغم هذا لا يمكنك اكتشاف الجنين ومشاهدته عبر جهاز الموجات فوق الصوتية أو السونار.يبلغ حجم الجنين طرف القلم، أي ما يمثل 2 ملليمتر، وهذا يعني أنه مازال صغير جدًا";
                    n12 = "تتضح أعراض الأسبوع الخامس من الحمل للمرأة، لأنها تكون قوية وتشعر المرأة بواحد من هذه الأعراض على الأقل، مثل التالي: غثيان الصباح-الدوار-كثرة التبول-حاسة الشم الحادة-المغص-نزيف مهبلي-إعياء-الإمساك-تغييرات في الثدي مثل الحنان والتورم-الرغبة الشديدة في الطعام أو النفور منه-زيادة إفرازات المهبل-تقلب الحالة المزاجية";
                    n13 = "إن لم تكوني حددتي موعد مع الطبيب، يمكنك الاتصال به فورًا-الحفاظ على التغذية السليمة، والتي تحتوي على البروتينات الخالية من الدهون، والخضروات والفواكه الحبوب الكاملة-الابتعاد عن المشروبات التي تحتوي على الكافيين-الابتعاد عن التدخين-تناول مكملات حمض الفوليك الغذائية، للوقاية من تشوه الأجنة أو ولادة طفل يعاني من عيوب خلقية";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==6)
                  {
                    n11 = "خلال الأسبوع السادس من الحمل، يتطور نمو الأعضاء الحيوية لطفلك، مثل الدماغ والرئتين وغيرها من الأعضاء، يبلغ طول طفلك حوالي 1/8 إلى 1/4 بوصة، وهو ما يقرب من حجم حبة الرمان.وينمو شيء صغير في جسم طفلك، يشبه الذيل الصغير، والذي سيصبح عمودًا شوكيًا فيمّا بعد، أما البراعم الصغيرة الموجودة على أطراف جنينك، في طريقها لتصبح الساقيين والذراعيين والأذنين، ويكون لدى الجنين أسنان وطبقة رقيقة من الجلد.في هذه المرحلة يمكن سماع نبض قلب الجنين، من خلال جهاز الموجات فوق الصوتية، أو السونار، بينما لا يمكنك اكتشاف ملامح الطفل تعود إلى مَن أو تشبه مَن، الأب أم الأم";
                    n12 = "الغثيان الصباحي: عادًة ما تعاني 80 بالمائة من النساء الحوامل، من القيء خلال الشهور الأولى من الحمل، وبالنسبة للعديد من النساء لا يعانين من الغثيان خلال فترة الصباح فقط-كثرة التبول-إعياء: هو شعور طبيعي نتيجة زيادة هرمونات الحمل-تورم الثديين و التهابهما-تصبح حلمات الثديين لونها أزرق-الانفعال الزائد-يبدأ الرحم في النمو ويزداد تدفق الدم إلى الكليتين، ما يؤدي إلى زيادة الضغط على المثانة وإدرار البول، وبالتالي زيادة الرغبة في الدخول إلى الحمام";
                    n13 = "تناول الفيتامينات ففي هذه المرحلة يحتاج جسمك إلى الفيتامينات والمعادن الضرورية لنمو الجنين واكتمال حملك بسلام، لذا يصف لكِ الطبيب المكملات الغذائية المناسبة لحالتك-ينصح الأطباء خلال الشهور الأولى من الحمل، بالابتعاد عن الاستحمام بالماء الساخن أو الذهاب إلى الساونا والحصول على حمام بخار، نظرًا لأنه يعرضك إلى خطر الإجهاض أو تشوه الجنين-شرب الماء بكثرة فأنتِ بحاجة إلى مضاعفة كمية المياه التي تتناولينها طوال اليوم، وينصح الأطباء بتناول من 8 إلى 12 كوبًا من المياه على مدار اليوم، مما يساهم في زيادة رطوبة الجسم وتنظيم ضغط الدم لديكِ-إن كنتِ تعانين من الغثيان الصباحي فأنتِ بحاجة إلى نظام غذائي صحي يعتمد على الوجبات الخفيفة، ويحتوي على البروتينات خالية الدهن، والكربوهيدرات الصحية، والخضروات والفاكهة-الاسترخاء يساعدك في التغلب على التوتر، الناتج عن أعراض الحمل التي يختبرها جسمك للمرة الأولى، أو يعيد اكتشافها من جديد إذا كان هذا الحمل ليس الأول بالنسبة إليكِ-التوقف عن التدخين بدءً من هذه اللحظة، اذا كنتِ مدخنة وذلك لأنه يعرضك لخطر الإجهاض، والكثير من المضاعفات الصحية مثل انخفاض وزن الجنين، عند الولادة، وكذلك التوقف عن شرب الكحول.إن لم تكون لاحظتي أعراض الحمل خلال الأسابيع الأولى، وهذه الأعراض تفاجئك، يجب عدم الانتظار إلى اكتمال الشهر الثاني أو الأسبوع الثامن من الحمل، والإسراع في إجراء اختبار حمل للتأكد، لأن من الأولوية الذهاب إلى الطبيب في هذه المرحلة للمتابعة";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==7)
                  {
                    n11 = "بحلول الأسبوع السابع من الحمل، يكون الجنين قد نما سريعًا ليصل إلى حوالي 10 ملليمتر أو 1/4 بوصة، من الرأس إلى الأسفل، ويُطلق على هذا القياس اسم طول التاج، وخلال هذا الأسبوع تستمر الخلايا العصبية في التكاثر والنمو مع بدء الدماغ والحبل الشوكي (الجهاز العصبي) في التبلور.كما ينمو الدماغ بسرعة ما يؤثر على نمو شكل الرأس بشكل أسرع، مقارنًة ببقية أعضاء الجسم، وتستمر العينان والأذنان في التطور والنمو، وبنهاية الأسبوع السابع من الحمل يكون طفلك قد حصل على جبهة كبيرة، وتبدأ الأذن الداخلية بالتطور، ورغم هذا لن تظهر الأذنين الخارجيتين على جانبي الرأس لبضعة أسابيع أخرى.تبدأ براعم الأطراف في النمو وتكوين غضاريف، تتطور إلى عظام الساقين والذراعين، ويمكن التفرقة بينهما من خال براعم الذراعين التي ستصبح أطول وتتسطح الأطراف لتتحول فيمّا بعد إلى يدين";
                    n12 = "قد تشعرين بالأعراض التالي ذكرها كلها أو بعضها تختلف وفقا لحالتك الصحية: الغثيان الصباحي-كثرة التقيؤ-الحاجة المستمرة إلى التبول-تضخم الثديين-سواد تحت العينين-التعب المستمر-النفور أو الرغبة الشديدة في الطعام-تشنج الحوض-فرط اللعاب أو البصق، وهو علامة عرضية تحدث لبعض النساء الحوامل.قد تلاحظين وضوح حجم البطن بعض الشيئ، وقد تلاحظين هذا من خلال ملابسك وعدم الارتياح فيها مثل السابق، ويتضح هذا في الأسبوع السابع أو الثامن من الحمل، ويعتبر الأسبوع السابع هو أسبوع التغيرات التي قد تكون أقوى من سابقيها، والأعراض التي تشعرين بها بقوة، مثل زيادة الوزن المحتملة أو فقدان بعض الوزن نتيجة قوة الغثيان الصباحي";
                    n13 = "في تلك المرحلة أيضًا عليكِ الاهتمام بصحتك من خلال اتباع نظام غذائي يحتوي على أطعمة صحية، وتجنب تناول المشروبات الغازية، والمشروبات التي تحتوي على الكافيين، والابتعاد عن التدخين والكحوليات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==8)
                  {
                    n11 = "طفلك الآن عمره ستة أسابيع، ويطلق عليه خلال هذه المرحلة (جنين)، يبلغ طول طفلك 11 إلى 14 ملليمتر، خلال هذا الأسبوع ينمو الذراعين والساقيين لدى طفلك، وتبدأ الأصابع والعضلات في النمو، يستمر طفلك في التحرك، ورغم ذلك لا تشعرين به";
                    n12 = "خلال هذا الأسبوع من الحمل، قد تعانين من الأعراض الآتية: إعياء-الغثيان طوال اليوم-قرحة المعدة-ألم في الصدر-زيادة وزن قليلة-كثرة التبول-صعوبة في النوم.تستمر الأعراض لمدة أسبوع متواصل، نظرًا لارتفاع مستويات هرمونات الحمل.ينمو حجم بطنك خلال هذا الأسبوع أكبر قليلًا من حجم الليمون، إن التغيرات التي تشعرين بها في الأسبوع السابع من الحمل، تستمر معك حتى الأسبوع الثامن من الحمل، حيث لا تشعرين بالارتياح عند ارتداء الملابس الضيقة عند منطقة الخصر.ربما اكتسبتي بعض الوزن خلال هذا الأسبوع، إلا أن التغير الأكبر بالنسبة إليكِ هو الرحم الذي بدأ يتسع لاستيعاب طفلك الذي ينمو سريعًا، خلال هذا الأسبوع تدفق الدم يكون أسرع، إلا أن جسدك يتكيف مع التغيرات الجديدة";
                    n13 = "يتعين عليكِ اتباع تلك النصائح للوصول بطفلك إلى بر الأمان: تناول وجبات خفيفة، تحتوي على جميع العناصر الغذائية اللازمة لجسمك، ونمو جنينك، وهي التي تحتوي على الكربوهيدرات والبروتينات-تناول مكملات حمض الفوليك الغذائية-ممارسة التمارين الرياضية، البسيطة وغير الشاقة، والمناسبة لحالتك";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==9)
                  {
                    n11 = "في الأسبوع التاسع، ينمو رأس الطفل بشكل أكثر وضوحًا من باقي أجزاء الجسم، ويصبح طوله يتراوح ما بين 16 إلى 18 ملليمتر، ويبلغ وزنه 3 جرام، ويتطور الأنف، ويتبلور الجلد فوق العينين مكونًا الجفون، ويستمر الجهاز الهضمي في النضج، فتتشكل فتحة الشرج والأمعاء،وتبدأ الأعضاء التناسلية الداخلية في النمو، مكونةً الخصيتين والمبيضين، وتدخل العضلات في طور التكوين";
                    n12 = "تطرأ بعض التغيرات على جسم الأم في الأسبوع التاسع من الحمل، بعضها تشعرين به بشكل ملحوظ فى شكل جسمك، ولكن بالطبع تختلف تلك الأعراض من سيدة لأخرى: يبدأ محيط الخصر في الزيادة-تتردد الأم على المرحاض بشكل أكبر خلال اليوم-الشعور بالإجهاد في أغلب الأحيان-يزداد معدل الهرمونات في جسمك-ينخفض مستوى سكر الدم والضغط-حرقة المعدة ومشكلات في الهضم والإمساك";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية الكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج الأم في هذا الأسبوع إلى تناول فيتامين B6 لدعم تطور المخ والجهاز العصبي لدى الجنين، كما يقلل من الشعور بالقيء والغثيان لدى الأم.ويتوافر فيتامين B6 في بعض الأطعمة مثل الموز والأفوكادو والفستق والسبانخ وبذور عباد الشمس والطماطم";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==10)
                  {
                    n11 = "بحلول الأسبوع العاشر من الحمل، تكون جميع الأعضاء الحيوية للطفل قد تكونت، وتبدأ في العمل معًا، وتتشكل براعم الأسنان داخل الفم، وإذا كان الطفل ذكر، تبدأ الخصية في إنتاج هرمون التستوستيرون، وإذا كان الجنين أنثى، يبدأ المبيض في إنتاج هرمون الإستروجين";
                    n12 = "تظهر بعض العروق الزرقاء على الجلد، وتحديدًا بمنطقة البطن والثدي، إلى جانب بعض الأعراض الأخرى مثل: الإجهاد الذي يستمر خلال الثلث الأول من الحمل، لكن لا داعي للقلق، فسوف ينتهي في الأسابيع المقبلة-الرغبة في تناول الطعام، وفي هذه الحالة، يجب الانتباه إلى الحصول على العناصر الغذائية اللازمة للجسم-حرقة المعدة والإمساك والغازات-نزول إفرازات بيضاء من الثدي-الشعور بالصداع أحيانًا نتيجة التغيرات الهرمونية التي تحدث بالجسم-الشعور بالدوار نتيجة حاجة الجسم باستمرار إلى الدم المتدفق خلاله، وفي هذا الوقت، يجب الحرص على تناول وجبات خفيفة منعًا للإغماء";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم.تحتاج الأم في الأسبوع العاشر من الحمل إلى تناول المزيد من الألياف، لتقليل فرص التعرض لسكري الحمل وارتفاع ضغط الدم والوقاية من الإصابة بالإمساك.ويجب أن تتناول الأم مقدار 25 - 35 جرامًا من الألياف، والتي تتوافر في بعض الأطعمة مثل الأرز البني والبقوليات والبروكلي وغيرها";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==11)
                  {
                    n11 = "في هذا الأسبوع، ينمو طفلك بسرعة أكبر، حيث يزداد طوله ليصل إلى 20 سم، كما تنمو الأوعية الدموية في المشيمة من حيث الحجم والعدد، لتزويد الطفل بالعناصر الغذائية، ويستمر الوجه والأذنين في التطور والنمو.وعلى الرغم من تطور الأعضاء التناسلية في تلك الأثناء، إلا أن الأعضاء التناسلية للذكور والإناث تكون متشابهة في تلك المرحلة، ويصعب التمييز بينهما";
                    n12 = "مع بدء الأسبوع الحادي عشر من الحمل، يقل الشعور بالغثيان الصباحي، وتبدأ الأم في الإحساس بالجوع وفتح الشهية للحصول على العناصر الغذائية اللازمة لجسمها وللجنين، وسرعان ما تشعر بالشبع بعد تناول الطعام نتيجة نمو الرحم وكونه يضغط على المعدة والأمعاء. ومن بين الأعراض التي تظهر على الأم أيضًا: التبول المتكرر-تغيرات في الثدي-الانتفاخ والغازات.وخلال هذه الفترة، قد تشعرين بألم في الساقين ومشكلات بالأسنان، نتيجة انسحاب الكالسيوم وغيره من المغذيات عبر المشيمة إلى الجنين";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج المرأة في هذا الأسبوع إلى تعويض انسحاب الكالسيوم من الجسم، وذلك عن طريق تناول جرعات عالية من الكالسيوم والبروتين، لتفادي المشكلات الصحية";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==12)
                  {
                    n11 = "تستمر دماغ الطفل في التطور، كما تدخل الأظافر في طور التكون، وتتشكل الأحبال الصوتية، وتبدأ الكليتان في العمل، وتشق الأمعاء طريقها وتتكون البطن، وبالفعل تكون الغالبية العظمى من أجهزة الجسم قد تكونت";
                    n12 = "يطلق على هذا الأسبوع اسم (توهج الحمل)، حيث تصبح بشرة الأم أكثر إشرافًا من الأسابيع الماضية، وتتورد الوجنتين بفعل تدفق الدماء ويزداد حجمها، فضلًا عن زيادة الهرمونات. وتحتاج المرأة في تلك الفترة إلى الاهتمام بالتغذية السليمة، وتجنب التعرض للتدخين السلبي، مع الاهتمام بالحصول على القدر الكافي من الراحة والنوم، ومن بين الأعراض المصاحبة لهذا الأسبوع: زيادة حاسة الشم-قلة التبول المتكرر-الصداع في بعض الأحيان-زيادة إفراز اللعاب-الغازات والانتفاخ";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم قد يبدأ الطبيب في إعطاء الأم بعض الفيتامينات والمقويات التي يحتاجها الجسم وتساهم في نمو الجنين، إذا كانت المرأة في حاجة لذلك، وعلى رأسها فيتامين د، حيث يساعد على امتصاص الكالسيوم اللازم لبناء عظام الجنين";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==13)
                  {
                    n11 = "تشهد هذه المرحلة تطور المشيمة، لتضاف إليها وظائف أخرى بخلاف إمداد الطفل بالمغذيات والأكسجين، مثل التخلص من النفيات، وإطلاق هرموني البروجيستيرون والإستروجين مما يساعد في الحفاظ على الحمل.وقد يكون الطفل قادرًا على وضع إصبعه في فمه، على الرغم من أن عضلات الامتصاص لم تتطور بعد، وبداية من ذلك الأسبوع، يمكنك معرفة نوع الجنين، ولكن قد لا يتمكن الطبيب من الرؤية وتأكيد النوع لك";
                    n12 = "على الرغم من استمرار بعض أعراض الحمل مثل الإمساك والغازات والانتفاخ والدوخة، ولكن سوف تلاحظين أنها أقل حدة من الأسابيع السابقة، وسيظل جسدك في حاجة إلى التغذية السليمة، فيجب تناول الأطعمة الغنية بالعناصر الغذائية";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج الأم إلى تناول المزيد من الأطعمة الغنية بحمض الفوليك، والزنك، والحديد، والكالسيوم، مع مراعاة الفصل بين الوجبات، لضمان امتصاص الجسم للمغذيات بشكل كامل";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==14)
                  {
                    n11 = "يبدأ شعر الجنين في الظهور، وتتطور الأعضاء التناسلية، وتبدأ في إنتاج هرمونات الغدة الدرقية، ويزن الطفل 45 جرامًا، ويبلغ طوله حوالي 9 سم، ويبدأ في تحريك أطرافه بشكل جيد";
                    n12 = "في هذا الأسبوع، قد تشعر المرأة بحركة طفيفة على هيئة نبضات صغيرة في الرحم، وستلاحظ أن أعراض الحمل أصبحت أقل حدة، حيث قد يقل الغثيان الصباحي، وتسترد المرأة القليل من طاقتها وتتحسن حالتها النفسية تدريجيًا، وتظهر بعض التغيرات في حجم الثدي، ولكنها تظل في حاجة إلى الراحة، ومواصلة تناول المكملات الغذائية، والاهتمام بالتغذية السليمة، وشرب كميات وفيرة من الماء";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج الأم في هذه الفترة إلى المواظبة على تناول المكملات الغذائية اللازمة، مثل الحديد والكالسيوم وفيتامين سي وفيتامين A تحت إشراف الطبيب المختص";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==15)
                  {
                    n11 = "يتطور جلد الطفل ويصبح أكثر رقة وشفافية، وتكون الأوعية الدموية بارزة من خلاله، كما تتكون العضلات الرئيسية في المعصمين والساقين والقدمين، مما ينعكس على حركة الجنين";
                    n12 = "في هذا الأسبوع، تبدأ التغيرات الفسيولوجية على جسد الأم في الظهور أكثر، حيث ينتفخ البطن، ويبدأ هرمون اللبن في التكون بالثدي، مما يجعله أكبر حجمًا، كما تشعر بارتفاع في درجة حرارة الجسم، الأمر الذي يستدعيها إلى ارتداء ملابس قطنية، لامتصاص العرق ومنع الالتهابات.وربما تعاني من احمرار ونزيف اللثة عند استخدام الفرشاة في تنظيف الأسنان، كما يمكن أن تنسى الأم بعض الأشياء أو تشعر بالصداع نتيجة تغير الهرمونات في الجسم";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج الأم في هذا الأسبوع إلى تناول فيتامين B1، لتحسين وظائف الجهاز العصبي والقلب والعضلات لدى الجنين، فضلاً عن تطور عقله، ويتوافر هذا الفيتامين في البقوليات والحليب والبرتقال والمكسرات والشوفان والقمح وغيرها";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==16)
                  {
                    n11 = "في ذلك الأسبوع، يزن الطفل 110 جرام، بينما يبلغ طوله 12 سم، وتتطور عضلات الوجه ويستطيع تحريكه والقيام ببعض التعبيرات، مثل التحديق، والعبوس، والابتسام، وتتابع الأعضاء التناسلية نضجها.ويمكن للجنين في هذا الأسبوع سماع صوت الأم من داخل الرحم، بل ويمكن رؤية الأوعية الدموية الخاصة بالجنين تحت جلده الرقيق";
                    n12 = "يزداد وزن الأم عن الأسابيع الماضية، وقد تشعر بانتفاخ أو تورم في القدمين بسبب تراكم بعض الأملاح في الجسم، ويمكن التغلب على هذه المشكلة، بالاستلقاء على السرير أو عمل كمادات دافئة على الأطراف السفلية، لتنشيط الدورة الدموية بها.وتستمر بعض الأعراض البسيطة مثل الإمساك وزيادة إفرازات المهبل وألم الظهر وزيادة حجم الثدي";
                    n13 = "بعض النصائح قد تجدين انها تتكرر من أسبوع لآخر مثل النصائح العامة الخاصة بتناول أكل صحي والابتعاد تمامًا عن المشروبات الغازية والكافيين والكحوليات والتدخين، بالإضافة إلى الفيتامينات التي تحتاجها الأم تحتاج الأم في هذا الأسبوع إلى تناول الزنك اللازم لنمو الخلايا، فضلاً عن تقوية المناعة لمحاربة العدوى ونزلات البرد وغيرها، ويتواجد في الكاجو واللوز والسوداني والزبادي وصفار البيض";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==17)
                  {
                    n11 = "يزن طفلك في ذلك الأسبوع حوالي 140 جرام، ويبلغ طوله حوالي 13 سم، وتشهد المشيمة مرحلة جديدة من النمو، فهي تحتوي الآن على الأوعية الدموية الدقيقة التي تساهم في نقل الأكسجين والغذاء بشكل أكثر فعالية إلى الجنين.كما تبدأ الدهون في التكون، مما يساعد طفلك على التمثيل الغذائي، وبدأت الرئتان تفرزان السائل الأمنيوسي، وتعمل أجهزة الدورة الدموية والجهاز البولي، ويملأ الشعر على الرأس والحاجبين والرموش.غضروف الجنين المطاطي يتحول الآن إلى عظم، ويبدأ ظهور بعض اللحم على تلك العظام، وكذلك الدهون";
                    n12 = "زيادة الوزن: تبدأ المرأة في الشعور بعدم التوازن قليلًا فمع زيادة الوزن قد تشعرين بثقل على قدميك، ويفضل في تلك الفترة ارتداء أحذية مناسبة بكعب منخفض لتقليل خطر السقوط-جفاف العين: قد تلاحظين في تلك الفترة تعرض عيناكي للجفاف وهنا يمكنك استخدام قطرات الترطيب التي لا تستلزم وصفة طبية، وعليكي الابتعاد عن ارتداء العدسات اللاصقة لأنها تزيد من مخاطر التعرض لجفاف العين، وإذا كنتي ترتدين عدسات طبية فحان وقت استبدالها بالنظارات حتى الولادة-الغدد اللبنية وفي هذا الأسبوع تنمو الغدد المسئولة عن إنتاج الحليب، وبالتالي قد تلاحظين تغيير في شكل ولون وحجم الثدي أكثر من الأسبوع الماضي، لذا عليكِ ارتداء حمالات صدر قطنية، وممارسة بعض التمارين الرياضية الخاصة بالثدي تحت إشراف الطبيب، خاصةً في حال وجود حلمات غائرة-زيادة السوائل الجسدية تزداد الإفرازات المهبلية والعرق والمخاط والسوائل الأخرى بكامل قوتها بسبب زيادة تدفق الدم";
                    n13 = "لتجنب الشعور بالدوار أو الإغماء، قومي بتغيير المواقف ببطء، خاصة عند الانتقال من وضعية الاستلقاء إلى الجلوس أو من وضعية الجلوس إلى الوقوف، وإذا كنت تشعر بالدوار، اجلس وخفض رأسك، أو استلق للحظة-واظبي على شرب كميات كافية من السوائل لترطيب جسمك-مازلتِ تحتاجين إلى نظام غذائي متوازن سليم، غني بالبروتين، فأنت وجنينك بحاجة إلى ذلك";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==18)
                  {
                    n11 = "طفرة النمو السريع لطفلك تنحسر، لكن ردود الفعل بدأت تتأرجح، فيمكن للطفل أن يتثاءب، ويمتد، ويجعل تعابير الوجه، حتى العبوس، وبدأت براعم التذوق في التطور ويمكنه التمييز بين الحلو والمر.تنتقل آذان طفلك إلى موقعها النهائي وتبرز من الرأس، ويكون قادرًا على السمع، حيث تتطور عظام الأذن الوسطى والنهايات العصبية من الدماغ حتى يسمع طفلك أصواتًا مثل دقات قلبك وتحرك الدم عبر الحبل السري، قد يكون مندهشًا من الضوضاء العالية.كما تتطور عيني طفلك أيضًا، فهي الآن توجه إلى الأمام بدلاً من الجوانب، وقد تكون الشبكية قادرة على اكتشاف شعاع مصباح يدوي إذا حملته على بطنك، وإذا تم تسليط ضوء ساطع على بطنك، فمن المحتمل أن يتحرك الطفل لحماية عينيه.كانت عظام طفلك تنمو لكنها كانت لا تزال ناعمة، ولكنها هذا الأسبوع تبدأ في التصلب أو التحجر، وأول العظام التي تتحجر هي تلك الموجودة في الترقوة والساقين";
                    n12 = "زيادة حجم البطن: لازالت بطنك تنمو ويزداد حجمها، فقد بدأت الاستعداد للحياة مع طفلك، هذا أسبوع جيد لبدء البحث عن طبيب أطفال أو مقدم رعاية صحية آخر لطفلك-تورم القدمين والساقين: قد يكون لديك بعض الأعراض الحامل غير الممتعة لمدة 18 أسبوعًا، مثل تورم القدمين أو اليدين ، وآلام الظهر، وتشنجات الساق ونزيف الأنف، وهذا قد يعرضك للتوتر والانزعاج وتظلين مستيقظة في الليل لساعات طويلة، ولكن لا داعي للقلق طالما أن التورم ليس مفاجئًا أو حادًا-آلام الظهر: زيادة حجم الطفل تشكل ضغط كبير على الظهر فتسبب آلاما شديدة-تشنجات الساق: يمكن أن تحدث تشنجات في الساق، وتكون علامة على الجفاف لذا يجب شرب كميات كافية من الماء-تورم الأوردة: تتورم بعض الأوردة بسبب الضغط الإضافي الذي يشكله الجنين على الدورة الدموية، وهذا يحتاج إلى تحريك الساق للأعلى بقدر المستطاع، مع ممارسة التمرينات الرياضية، وتجنب الملابس والأحذية الضيقة-نزيف الأنف: هو أمر ليس شائعًا ولكن يشعر به البعض بسبب زيادة الضغط على الأوردة في أنفك قد تجعله ينزف أكثر من المعتاد، فإذا كنت مصابًا بنزيف في الأنف ، فاضغط على أنفك لمدة خمس إلى عشر دقائق، أو قومي بوضع كيس الثلج لإيقاف النزيف";
                    n13 = "لازالتِ بحاجة إلى نظام غذائي متوازن غني بالبروتين والفيتامينات والمعادن المفيدة لنمو طفلك خاصة الحديد، والكالسيوم، والماغنيسيوم، والزنك، ولكن يفضل الابتعاد عن الدهون، والسكريات، والأملاح.حان الوقت لتغيير الأشياء عليكِ النوم على جانبك بدلًا من ظهرك، بدءًا من الأسبوع الثامن عشر من الحمل. وذلك لأن الطفل (ورحمك) يكبران بما يكفي للضغط على الأوردة الكبيرة في الجزء الخلفي من البطن، ما قد يقلل من كمية الدم التي تصل إلى القلب، فتشعرين بالدوار - أو الأسوأ، وخفض ضغط الدم، ويمكن تجنب تلك المشاكل تمامًا بمجرد النوم على جانبك فذلك يساهم في تدفق الدم إلى الرحم";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==19)
                  {
                    n11 = "في الأسبوع الـ19 يبلغ طول الجنين 15 سم، ويبلغ وزنه 241 جم، فيكون أشبه بحبة المانجو، يقوم بتطوير طبقة واقية على جلده تسمى فيرنيكس كاسيوزا، ويكون دهني وأبيض وقد ترى بعضًا منه عند الولادة. كما تعمل حواسه الخمسة، وتتطور جميع الخلايا العصبية لإحساس الذوق والسمع والبصر والشم في دماغ الجنين.وفي الأسبوع الـ19 تصبح حركة الجنين داخل بطنك ملحوظة، وربما تبدو هذه الحركات الصغيرة أشبه بالرفرفة أو حتى الغاز، لكنها ستزداد قوة خلال الأسابيع القليلة القادمة، وسيكون هناك المزيد من الوقت قبل أن يشعر شريكك أو أي شخص آخر بتلك الركلات، وحتى ذلك الحين، استمتعي بهذا الشيء الصغير بينك وبين طفلك، فأنتما الاثنان مترابطان بالفعل";
                    n12 = "في الأسبوع الـ19 من الشهر الخامس تظهر عليكِ بعض الأعراض الحادة ولكنها لا تكون شديدة، فتعاني من: آلام في البطن: يزداد ألم البطن والظهر السفلي في الأسبوع التاسع عشر بسبب تمدد عضلاتك لاستيعاب الطفل-الدوار والغثيان أحيانًا: يحدث الدوار أثناء الحمل لأن الرحم المتنامي يضغط على الأوعية الدموية، بالإضافة إلى ذلك، يكدس الطفل رئتيك، لذا فتقل نسبة الأكسجين في الدم، وهناك عوامل أخرى تسبب الدوار منها الجفاف والجوع، لذا عليكِ الاعتماد على نظام غذائي متوازن-تشنجات الساق: لمقاومة تشنجات الساق، عليكِ فرد وثني كاحليك وأصابع قدميك باتجاه ركبتيك، ويمكن الاستعانة بشريكك لتدليك الساق-ألم الفخذ: هو شعور يحدث لدى البعض وللتغلب على ألم الفخذ حاولي النوم على جانبك بوضع وسادة بين ركبتيك-تغيرات جلدية: تظهر بعض التغيرات الجلدية في ذلك الأسبوع بسبب زيادة هرمون الإستروجين، قد يكون لديك أيضًا بقع من الجلد الداكن على الشفاة العليا والخدين والجبين وهذا ما يسمى الكلف أو (قناع الحمل)، قد يحدث أيضًا تصبغ زائد مثل سواد الحلمة والنمش والندبات والإبطين والفخذين الداخليين والفرج.وقد تتسبب الأوعية الدموية المتوسعة في ظهور علامات حمراء صغيرة مؤقتة (تسمى وحمة العنكبوت) على وجهك وكتفيك وذراعيك";
                    n13 = "عليكِ الاعتناء بصحتك وراحتك النفسية، والاسترخاء، وتجنب زيادة وزنك أثناء نمو الجنين.لازلت بحاجة إلى نظام غذائي غني بالبروتين والفيتامينات والمعادن خاصة الحديد، الكالسيوم، الزنك، الماغنيسيوم، وتجنب الدهون والسكريات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==20)
                  {
                    n11 = "يبلغ طول الجنين 25 سم، ويزن 289 جرام، ويصبح في حجم ثمرة الموز، وتبدأ براعم الذوق لديه في العمل، فهو بإمكانه الآن ابتلاع جزيئات الطعام التي تتناوليها.ولكن، لا يعرف الباحثون ما إذا كان بإمكانه تذوق هذه الجزيئات أم لا، إلا أن بعض الأبحاث تفيد بأن الأطعمة التي تتناولها الأم أثناء الحمل، قد تؤثر لاحقًا على الأطعمة التي يفضلها الطفل لاحقًا.ولا يزال طفلِك محتفظ بالقدرة على الإنصات جيدًا، فهو يسمع صوتك ودقات قلبك وحركة أمعائك، وكذلك الأصوات خارج جسدك، لدرجة تدفعه إلى وضع يديه على أذنيه إذا سمع صوتًا عاليًا بالقرب منك.ويبدأ شعر طفلِك في النمو، إذ يغطي رأسه وظهره وكتفيه، وعادةً ما يتساقط في نهاية الأسبوع الأول من ولادته";
                    n12 = "يرتبط هذا الأسبوع بعدة أعراض: إفرازات مهبلية، ويمكنك توقع استمرارها حتى الولادة، وهي نتيجة مباشرة لارتفاع مستويات الهرمونات بالجسم-تشنجات الساق، ويمكنك التغلب عليها بممارسة تمارين الإطالة بانتظام، مع مراعاة شرب كميات كافية من المياه، لتحسين تدفق الدم إلى العضلات الموجودة بالأطراف، ما يساعد على استرخائها-حرقة المعدة، ويراعى الابتعاد عن الأطعمة الحامضة والدهنية والحارة، للتغلب عليها-رغبة جنسية عالية-ضيق في التنفس، بسبب توسع الرحم وامتداده نحو الرئة-زيادة الوزن-حكِّة الجلد، خاصة حول منطقة البطن، نتيجة امتداد الجلد، ليلائم حجم الجنين، ويمكن التغلب على هذه المشكلة باستخدام الكريمات المهدئة للبشرة-صعوبة النوم، ولكن بالاستلقاء على أحد جانبي الجسم، مع ثني الركبة، ووضع وسادة بين الساقين، سوف توفرين لنفسك الراحة التي تحتاجين إليها، للنوم بعمق، دون الشعور بالأرق-التهابات المثانة، نتيجة استرخاء بعض عضلات الجهاز البولي-التعرق الزائد، لأن الغدة الدرقية تكون في الأسبوع العشرين أكثر نشاطًا";
                    n13 = "لا زلتي بحاجة إلى نظام غذائي متوازنٍ، غني بالبروتين، والفيتامينات، والمعادن، خاصةً معدن الحديد، لأن الجسم يحتاج إلى المزيد من هذا المعدن، لمواكبة حجم دمك المتزايد، وملائمة تغذية طفلك المتنامي.تجنبي الوقوف لفترة طويلة جدًا، والاعتماد على رفع الأشياء بساقيك بدلًا من ظهرك";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==21)
                  {
                    n11 = "يبلغ طول الجنين 26.7 سم، ويزن 360 جرام، ويستطيع جسمه الآن اكتسابه الدهون بشكل ثابت، للتدفئة.لا تزال أعضائه في طريقها إلى النمو والاكتمال، إذ تتطور الأعضاء التناسلية، ويتكون العقي بجهازه الهضمي، وهي مادة سوداء قطنية، قد تعثرين عليها في حفاضة طفلِك، خاصةً في أيامه الأولى من بعد الولادة.وتتطور الأمعاء بما يكفي لامتصاص كميات صغيرة من السكريات من السائل الأمنيوسي، وتصنع الغدد الزيتية طبقة شمعية تغطي جسده، وتبدأ براعم الأسنان الدائمة في التكوُّن، ويتطور النخاع العظمي بما يساهم في تكوين خلايا الدم";
                    n12 = "يرتبط هذا الأسبوع بعدة أعراض: حرقة المعدة، التي تتطلب الابتعاد عن الأطعمة الدسمة والحارة-المخاض الكاذب، وهي تقلصات تشبه الآلام التي تعانين منها أثناء الدورة الشهرية-حكة الجلد، ويمكن التغلب عليها بدهن منطقة البطن بالزيوت الطبيعية أو الكريمات المهدئة بعد استشارة الطبيب-ظهور الدوالي أو الأوردة العنكبوتية، بسبب الضغط المتزايد على أوردة الساق وارتفاع مستويات البروجسترون بالجسم-ظهور علامات التمدد بشكلٍ واضح على الجلد";
                    n13 = "عليك رفع ساقيكِ إلى الأعلى، لتجنب زيادة الضغط على الأوردة، وعند النوم، يجب وضع وسادة بين فخذيك.ولأن الأربطة تصبح أكثر استرخاءً أثناء الحمل، يجب ممارسة بعض التمارين الخفيفة، مثل اليوجا والسباحة والمشي، بشرط استشارة الطبيب.أنتِ بحاجة إلى نظام غذائي متوازن، غني بالعناصر الغذائية المفيدة، كالبروتين، والفيتامينات والمعادن، خاصة الكالسيوم، والحديد، والماغنيسيوم، والزنك، ويفضل تجنب تناول الدهون والسكريات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==22)
                  {
                    n11 = "يبلغ طول الجنين 27.8 سم، ويزن 340 جرام، وتصبح عضلاته الآن أكثر قوة، ويبدأ شعر الجفون والحاجبين في النمو.تزداد حركة طفلِك بمجرد اعتياده على سماع أغنية أو لحن محدد، وقد يكون لهذه الأصوات دورًا لاحقًا في تهدئته، عندما يدخل في نوبات الصراخ والبكاء.تتطور الحواس التي يستخدمها طفلك للتعرف على العالم بشكل يومي، حيث تصبح براعم التذوق في طريقها للاكتمال، وتنمو النهايات الدماغية والعصبية بشكل يساعده على استخدام حاسة اللمس.يستمر الجهاز التناسلي في التطور، حيث تبدأ الخصيتان في النزول من البطن عند الذكور، ويكون الرحم والمبيض في مكانهما ويتطور المهبل عند الإناث";
                    n12 = "علامات تمدد الجلد تصبح أكثر وضوحًا-زيادة إفرازات المهبل، نتيجة تدفق الدم، ما يعزز من الدافع الجنسي-تورم اليدين والقدمين، نتيجة احتباس السوائل في الجسم، وهذا التورم أمر طبيعي تمامًا، وسوف يتلاشى بعد الولادة-آلام الظهر، لأن مع ازدياد حجم الطفل، يزداد الضغط على العمود الفقري، ويمكن التخفيف من حدة الألم بالاعتماد على كمادات المياه الدافئة";
                    n13 = "زيادة عدد سعراتك الحرارية إلى 300 سعرة إضافية في اليوم-زيادة عدد وجباتك مع تصغير حجمها، حيث يمكنك تناول خمس أو ست وجبات صغيرة على مدار اليوم، لتخفيف الحموضة وحرقة المعدة-إذا كنت تعانين من تقلصات في الساق، قومي بثني أصابعك تجاه وجهك، مع الحفاظ على ساقك مستقيمة-يُنصح بالحصول على المزيد من الكالسيوم والبوتاسيوم، مثل شرب كوب من الحليب قبل النوم أو تناول وجبة خفيفة من الأطعمة الغنية بالبوتاسيوم، مثل الجريب فروت، والبرتقال، والموز";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==23)
                  {
                    n11 = "يبلغ طول الطفل 28.9 سم، ويزن 500 جرام (ما يعادل ثمرة الباذنجان)، ولا تزال قدرته على سماع الأصوات في طريقها إلى التطور بشكل ملحوظ، إذ يستطيع الآن التفاعل مع صوت كلبك الأليف، والتحرك باستمرار كلما اشتد نباحه";
                    n12 = "تورم الوجه وحول العينين واليدين والقدمين، بسبب احتباس السوائل بالجسم-اضطرابات النوم، كالقلق والاستيقاظ للتبول-حرقة المعدة والحموضة-تشنجات الساق-المخاض الكاذب-آلام الظهر-نزيف وتورم اللثة";
                    n13 = "لا زال ظهرك يؤلمك؟ عليكِ بالاستلقاء والخلود إلى الراحة، مع تدليك الظهر أو استخدام الكمادات الدافئة-ومع تمدد بشرتك، قد تصبح جافة ويصاحبها الحكة، لذا يجب المواظبة على استخدام الكريمات المرطبة-الاستحمام بالماء الدافئ وقراءة كتاب وتناول كوب من شاي الأعشاب، هذه النصائح من شأنها أن تخلصك من الأرق، مع مراعاة النوم على أحد جانبي الجسم، ووضع وسادة بين فخذيك-واظبي على المشي قدر المستطاع، للتخفيف من تورم الأطراف-لا زلتي بحاجه إلى نظام غذائي متوازن، غني بالبروتين والفيتامينات والمعادن، خاصة الحديد، والكالسيوم، والماغنسيوم، والبوتاسيوم، والزنك";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==24)
                  {
                    n11 = "يحرز طفلِك تقدمًا ملحوظًا، إذ تتكون خلايا الدم البيضاء المسئولة عن مكافحة العدوى، وتصبح بشرته الشفافة متوهجة ويميل لونها إلى الوردي، بفضل الشعيرات الدموية الصغيرة التي تكونت مؤخرًا.تنمو الأكياس التنفسية برئتي طفلِك، وبذلك يصبح قادرًا على تبادل الأكسجين وثاني أكسيد الكربون بمجرد الولادة.قد يتمكن شريكك من سماع دقات قلب طفلِك، إذا وضع أذنه على بطنك";
                    n12 = "تكون أعراض الحمل أكثر إزعاجًا، مثل ركلات طفلِك، التي ستصبح أكثر قوة من الأسابيع الماضية";
                    n13 = "أنت بحاجة إلى نظام غذائي متوازن، غني بالعناصر الغذائية المفيدة، كالبروتين، والفيتامينات، والمعادن، خاصة الكالسيوم، والحديد، والماغنيسيوم، والزنك، مع مراعاة الابتعاد عن الدهون والسكريات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==25)
                  {
                    n11 = "عادة ما تستعد رئتي الجنين للتنفس في هذا الأسبوع، وعدم توافر الهواء يجعل طفلِك يتنفس السائل الأمنيوسي، وبالتالي يكون قادرًا على شم الروائح المختلفة في الرحم.يظل لون بشرة طفلِك مائل إلى الوردي، بفضل الأوعية الدموية التي تتشكل تحت جلده";
                    n12 = "يُعرف هذا الأسبوع باسم أسبوع الحموضة، بسبب إفراز الجسم لهرمون البروجسترون، الذي يقوم بإبطاء إفراغ المعدة";
                    n13 = "اتباع نظام غذائي متوازن، غني بالعناصر الغذائية المفيدة، كالبروتين، والفيتامينات، والمعادن، خاصة الكالسيوم، والحديد، والماغنيسيوم، والزنك، مع مراعاة الابتعاد عن الدهون والسكريات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==26)
                  {
                    n11 = "يبلغ طول الطفل 35.6 سم، ويزن 907 جرام، ويستطيع أن يميز صوت والده، وعلى الرغم من قدرته على فتح عينيه، إلا أنه لا يمكنه الرؤية.ويستطيع الطفل الضغط بالقدم أسفل البطن، وهي أحد المهارات الحركية التي تسبق المشي لاحقًا، فعندما يصبح الجهاز العصبي للطفل أكثر تطورًا، تصبح حركاته أكثر قوة، وقد تكون مؤلمة في بعض الأحيان";
                    n12 = "الشد العضلي-تورم القدمين، لدرجة لا تمكنك من ارتداء الأحذية-صعوبة النوم-زيادة تشنجات الساقين-حرقة المعدة-كثرة التردد على الحمام-الشعور بالخوف والقلق واضطراب المزاج";
                    n13 = "اتباع نظام غذائي متوازن، غني بالعناصر الغذائية المفيدة، كالبروتين، والفيتامينات، والمعادن، خاصة الكالسيوم، والحديد، والماغنيسيوم، والزنك، مع مراعاة الابتعاد عن الدهون والسكريات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==27)
                  {
                    n11 = "يبلغ طول الطفل 14 بوصة، ويصبح وزنه ضعف ما كان عليه قبل أربعة أسابيع، ويتطور سمعه بشكل ملحوظ، نتيجة نضوج شبكة الأعصاب الموجودة بالأذنين.كما تصبح براعم التذوق أكثر تطورًا، حيث يستطيع الطفل التفاعل مع مذاق الأطعمة التي تتناولها الأم، فإذا تناولت طعامًا حارًا، يتفاعل معه ويبدأ في الحركة";
                    n12 = "تشعر الأم في هذا الأسبوع بثقل في البطن، بالإضافة إلى زيادة الشعور بالحرقان وانبعاث حرارة من الثدي، وذلك نتيجة اكتمال نمو الغدد المسئولة عن إفراز الحليب، ومن الممكن أن يصاب الجلد ببعض الالتهابات، بسبب بروز البطن وزيادة الوزن";
                    n13 = "ترطيب البشرة باستمرار بالكريمات والزيوت الطبيعية-تدليك الثدي باستمرار-وضع القدم في الماء الدافئ، للتخلص من التورم-عدم الانحناء الشديد أو حمل الأشياء الثقيلة-ممارسة بعض التمارين الرياضية، مثل المشي أو السباحة، تحت استشارة الطبيب المختص-رفع القدمين عند النوم والجلوس-شرب كمية كافية من الماء والسوائل بشكل عام، للحفاظ على ترطيب الجسم-اتباع نظام غذائي غني بأحماض أوميجا 3، والفيتامينات، والمعادن، والبروتينات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==28)
                  {
                    n11 = "يزن الطفل 1000 جرام، ويبلغ طوله حوالي 25 سم، وضيق مساحة الرحم يدفعه الآن إلى الحركة المستمرة، للبحث عن الوضع المثالي بالنسبة له، وقد يؤثر ذلك لاحقًا على نوع الولادة.وفي الغالب، يتخذ الطفل وضع الولادة الطبيعية، حيث يكون رأسه متجهًا لأسفل باتجاه أقرب مخرج للجسم";
                    n12 = "اقتراب موعد الولادة، يجعل الأعراض أكثر حدة، إذ تعاني من الالتهابات الجلدية في منطقة البطن، والفخذين، والمؤخرة، مع استمرار الحكة";
                    n13 = "اتباع نظام غذائي، غني بالحديد في المقام الأول، إلا أن أحماض أوميجا 3 تستدعي استشارة الطبيب قبل تناول مصادرها من الأطعمة";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==29)
                  {
                    n11 = "يبلغ طول الطفل 37 سم، ويزن 1.25 كجم، ويتطور دماغه الآن بشكل سريع، وانكماش حجم الرحم يجعله كثير الحركة، وتصبح ركلاته التي يجب أن يصل عددها إلى 10 ركلات على مدار اليوم - أشد قوة مما سبق";
                    n12 = "هناك عدة أمور وارد أن تتعرضين لها هذا الأسبوع، ومنها: الشعور بارتفاع البطن-إمساك يصاحبه تقلصات بالمعدة-صعوبة التبرز-عدم الشعور بالراحة-انكماش مساحة الرحم-ظهور دوالي بالجسم";
                    n13 = "اتباع نظام غذائي غني بالخضروات والفواكه الغنية بالألياف اللازمة لتحسين حركة الأمعاء، وتسهيل عملية الهضم، والتخلص من الإمساك-تناول الأطعمة الغنية بمعدن الحديد-تناول الأطعمة الغنية بفيتامين سي، الذي يساعد جسمك على تصنيع الأنسجة الضامة، التي تعمل على إصلاح الأوعية الدموية-الحصول على ما يكفي من البروتين وحمض الفوليك والكالسيوم-شرب كميات وفيرة من المياه، تتراوح ما بين 10 و12 كوبًا يوميًا-ممارسة الرياضة – مثل المشي - لتحفيز حركة الأمعاء";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==30)
                  {
                    n11 = "يبلغ طول الطفل 38.5 سم، ويزن 1.4 كجم، وعلى الرغم من أنه الآن يستطيع متابعة مصدر الضوء بعينيه والتفرقة بينه وبين الظلام، إلا أنه بعد الولادة ستظل عينيه مغلقة، لأن الرضع بإمكانهم رؤية الأشياء على بعدٍ قليل من وجوههم، إذا تبلغ درجة رؤيتهم 20/400، في حين أن الرؤية الطبيعة للبالغين تصل درجتها إلى 20/20";
                    n12 = "يرتبط هذا الأسبوع بعدة أعراض مزعجة: الشعور الدائم بالتعب-الأرق وصعوبة النوم-تورم القدمين، نتيجة ارتفاع مستويات الهرمونات بجسدك-ضيق التنفس، لأن مع استمرار نمو الجنين، سوف يحد تمدد للرحم أسفل القفص الصدري";
                    n13 = "الحصول على حمض الفوليك من الخضروات الورقية، المكسرات، الفاصولياء، الحمضيات، ويمكن الحصول عليه أيضًا بتناول مكملاته الغذائية تحت استشارة الطبيب المختص-تناول الأطعمة والمشروبات الغنية بالكالسيوم اللازم لتعزيز نمو عظام الجنين-الحصول على ما يكفي من اليود على مدار اليوم، نظرًا لدوره الفعال في تحسين كفاءة عمل الغدة الدرقية، كما أن نقصه بالجسم قد يؤدي إلى توقف النمو البدني للجنين، وزيادة فرص ولادة أطفال يعانون من الإعاقات الذهنية الشديدة أو ولادة الأجنة الميتة-تناول الأطعمة الغنية بمعدن الحديد والفيتامينات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==31)
                  {
                    n11 = "يبلغ طول الطفل أكثر من 39.4 سم، ويتراوح وزنه ما بين 1.6 و1.8 كجم، ويدخل الجهاز التناسلي الآن مرحلة جديدة من التطور والنمو، إذ تنتقل الخصيتان عند الذكور من الكلى عبر الفخذ لتستقر في كين الصفن، ويظهر البظر عند الإناث.وعلى الرغم من تطور الرئة هذا الأسبوع، إلا أنها لم تصل إلى المرحلة النهائية من النضج، وفي المقابل، تكتمل وصلات الدماغ بما يساعد جنينك على استخدام حواسه الخمسة";
                    n12 = " قد يبدأ الثدي في إفراز مادة كريمية، تسمى باللبأ أو ما قبل الحليب، وعادةً ما تكون أكثر سمكًا من لبن الرضاعة الطبيعية.وعادةً ما تشعرين خلال هذه الفترة بانقباضات شديدة في عضلات الرحم، فضلًا تسرب البول عند العطس أو الضحك، نتيجة ضغط الجنين على المثانة";
                    n13 = "الحصول على حمض الفوليك من الخضروات الورقية، المكسرات، الفاصولياء، الحمضيات، ويمكن الحصول عليه أيضًا بتناول مكملاته الغذائية تحت استشارة الطبيب المختص-تناول الأطعمة والمشروبات الغنية بالكالسيوم اللازم لتعزيز نمو عظام الجنين-الحصول على ما يكفي من اليود على مدار اليوم، نظرًا لدوره الفعال في تحسين كفاءة عمل الغدة الدرقية، كما أن نقصه بالجسم قد يؤدي إلى توقف النمو البدني للجنين، وزيادة فرص ولادة أطفال يعانون من الإعاقات الذهنية الشديدة أو ولادة الأجنة الميتة-تناول الأطعمة الغنية بمعدن الحديد والفيتامينات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==32)
                  {
                    n11 = "يبلغ طول الطفل ما يزيد عن 40.6 سم، ويتراوح وزنه ما بين 1.8 و2 كجم، وتتشكل الآن أظافر يديه وقدميه، وتستمر رئتيه في النمو والنضوج، كما يتكون هيكله العظمي، مع العلم أن العظام في هذه المرحلة يكون ناعمًا ومرنًا للغاية";
                    n12 = "يرتفع الجزء العلوي من الرحم، ما يؤدي إلى صعوبة التنفس، نتيجة الضغط الذي يشكله الرحم على الحجاب الحاجز، والذي يتسبب أيضًا في زيادة نسبة الحموضة المعوية.يزداد حجم دمك، ليتراوح ما بين 40 و50%، تمهيدًا لتعويض الدم الذي ستفقديه أثناء عملية الولادة.زيادة الوزن بشكل ملحوظ، ولذلك، يجب الابتعاد عن المقليات والحلويات، واستبدالها بالخضروات والفواكه الغنية بالعناصر الغذائية التي تحتاجين إليها أنت وطفلك.خلال هذه الفترة، قد تشعرين أيضًا بالتعب وحرقة المعدة ، ولكن لا داعٍ للقلق، فهو أمر شائع في الثلث الثالث من الحمل، ويرجع ذلك جزئيًا إلى نمو الرحم";
                    n13 = "اتباع نظام غذائي غني بـ (حمض الفوليك، فيتامين د، الحديد، اليود، الكالسيوم)، ويمكن الحصول على هذه العناصر الغذائية عن طريق المكملات، التي يراعى تناولها تحت استشارة الطبيب";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==33)
                  {
                    n11 = "يبلغ طول الطفل 43.8 سم، ويزن 1.9 كجم، وأصبح بالغًا بما يكفي للعيش خارج الرحم، وعلى الرغم من الحماية التي يوفرها جهازك المناعي له، إلا أنه مناعته الآن أصبحت قادرة على مكافحة الملوثات";
                    n12 = "يرتبط هذا الأسبوع بعدة أعراض مزعجة: آلام الحوض-كثرة التبول-الإمساك-ارتفاع دقات القلب، في محاولة لاستيعاب التغيير في نسبة الدماء الذي ازدات بنسبة تتجاوز 40%-آلام الظهر-تورم الكاحلين والقدميين-صعوبة في النوم-عدم القدرة علي التنفس";
                    n13 = "يجب الحصول على مكملات الحديد والكالسيوم، تحت إشراف الطبيب-اتباع نظام غذائي غني بالخضروات، الغنية بالألياف المفيدة لصحتك الآن، للتغلب على الإمساك-تناول منتجات الألبان للحصول على الحصة اليومية من البروتينات";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==34)
                  {
                    n11 = "يبلغ طول الطفل 45 سم، ويزن 2.15 كجم، وتتحرك رأسه إلى أسفل، وتزداد كثافة الطلاء الجبني، استعداد للولادة.وضيق مساحة الرحم بالنسبة لحجم الطفل، سوف تجعله كثير الحركة، بمعدل حركة واحدة على الأقل كل 20 دقيقة";
                    n12 = "يرتبط هذا الأسبوع بعدة أعراض مزعجة: زيادة في الوزن، بسبب ازدياد حجم الجنين، بالإضافة إلى احتباس السوائل بالجسم-آلام شديدة بالعظام، بسبب سحب الجنين لعنصر الكالسيوم بالجسم-صعوبة النوم-ضيق التنفس-حرقة المعدة-عسر الهضم";
                    n13 = "يجب تناول مكملات الحديد والكالسيوم، تحت إشراف الطبيب المختص، لتحديد الجرعات التي تحتاجين إليها-تناول الخضروات، للاستفادة من عناصر الغذائية، خاصةً الألياف، للتغلب على عسر الهضم والإمساك-تناول منتجات الألبان، للحصول على البروتينات والكالسيوم";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==35)
                  {
                    n11 = "ييلغ طوله 46.2 سم، ويزن 2.29 كجم، وتصبح جمجمة الطفل ناعمة ولينة، بشكل يسمح بانزلاقها من فتحة المهبل أثناء الولادة بسهولة";
                    n12 = "سوف تعانين من كثرة التبول خلال هذه المرحلة، وقد يصل الأمر إلى حد الإصابة بسلس البول، ويمكن التغلب على هذه المشكلة بممارسة تمارين الكيجل، التي تساهم في تقوية عضلات الحوض، ولكن يراعى استشارة الطبيب قبل الشروع في ممارستها";
                    n13 = "اتباع نظام غذائي غني بـ (حمض الفوليك، فيتامين د، الحديد، اليود، الكالسيوم)، ويمكن الحصول على هذه العناصر الغذائية عن طريق المكملات، التي يراعى تناولها تحت استشارة الطبيب-ممارسة بعض التمارين الرياضة الخفيفة، لتحسين معدل ضربات القلب ومستويات الأكسجين-الابتعاد عن الأطعمة الدسمة والحارة، للتخفيف من حدة الحموضة وحرقة المعدة";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==36)
                  {
                    n11 = "يبلغ طول الطفل 46 سم، ويزن 2.7 كجم، وغالبًا ما تكون وتيرة نموه أبطء من الأسابيع الماضية، في محاولة منه للتكيف مع ضيق الرحم.ومن المفترض أن يكون طفلِك الآن قد تحرك رأسًا على عقب، إلا أن بعض الأطفال قد يفشلون في اتخاذ هذه الوضعية، الأمر الذي يضطر الطبيب إلى اللجوء للولادة القيصرية.كما يشهد جهازه المناعي وكذلك دورته الدموية تطورًا ملحوظًا، لحماية من الالتهابات المحتمل أن يتعرض لها فور الخروج من الرحم بعد الولادة";
                    n12 = "أكثر ما تعانيه هذا الأسبوع، الانقباضات الرحمية غير المنتظمة، فضلًا عن الشعور بآلام شديدة أسفل البطن والظهر";
                    n13 = "بخلاف أحماض أوميجا 3 التي تحتاجين إليها في هذه المرحلة، أنت أيضًا في حاجة إلى فيتامين B6، لأنه يساعد على نمو خلايا الطفل، كما يلعب دورًا هامًا في تطوير دماغه وجهازه العصبي.ومن أبرز الأطعمة الغنية بفيتامين B6 (الموز، الأفوكادو، جنين القمح، الأرز البني، دقيق الشوفان، البطاطس، السبانخ، الطماطم، الأسماك، اللحوم)";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==37)
                  {
                    n11 = "يبلغ طول الطفل 48.6 سم، ويزن 2.7 كجم، وضيق مساحة الرحم سوف تجعله كثير الحركة، وعلى الرغم من أن عظامه لا تزال ليِّنة، إلا أنها أكثر صلابة من الأسابيع الماضية.يستطيع الجنين الآن القيام بعملية التجشؤ، وجميع وظائفه الحيوية تعمل على أكمل وجه، وتقترب الرئة من اكتمال النضج، استعدادًا للقيام بعملية التنفس بصورة طبيعة بعد الولادة";
                    n12 = "من أبرز الأعراض التي تواجهك مع بداية آخر شهر في رحلة الحمل: صعوبة شديدة في النوم-ضيق في التنفس-رغبة متكررة في التبول-ألم شديد أسفل الظهر-ألم أسفل البطن-صعوبة في المشي والحركة-انتقاخ البواسير-زيادة حمض المعدة-زيادة الوزن-قد تعاني بعض السيدات من نزول القليل من السائل الأمينوسي المحيط بالجنين";
                    n13 = "تناول الخضروات والفواكه الطازجة، والابتعاد عن الأطعمة الدسمة التي تسبب الحموضة-شرب كميات وفيرة من المياه، للحفاظ على رطوبة الجسم-تناول بعض المكملات الغذائية للحفاظ على صحتك وصحة جنينك، مثل (الحديد، الكالسيوم، الماغنسيوم)";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==38)
                  {
                    n11 = "يبلغ وزن الطفل حوالي 2800 جرام، ويبدأ في النزول إلى الحوض، وأخذ وصعية الولادة وتصبح رأسه متجهة إلى الأسفل.تكتمل جميع الأعضاء الحيوية، باستثناء الرئتين والدماغ التي تتطور بعد الولادة وخلال المرحلة المبكرة من الطفولة";
                    n12 = "قد تزداد صعوبة الأعراض في تلك المرحلة من الحمل، ولكن لا داعٍ للقلق، فهي أعراض طبيعية، تشير إلى أن جنينك أصبح مستعدًا للخروج للحياة، ومنها: الشعور بالألم أسفل البطن والظهر عند تحرك الجنين-الأرق وصعوبة النوم-عدم القدرة على التنفس بشكل طبيعي، بسبب ضغط الجنين على الحجاب الحاجز والرئتين-ثقل أسفل البطن-صعوبة في الحركة-حرقان في البول-كثرة التبول-تورم في اليدين والقدمين-نزول إفرازات مدممة أو وردية اللون";
                    n13 = "الابتعاد عن الأطعمة الدسمة والمحليات الصناعية-عدم تناول الأطعمة المملحة، ومراعاة تقليل كمية الملح المضافة إلى الأطعمة، لتجنب ارتفاع ضغط الدم-تناول الخضروات والفواكه الغنية بالمعادن والفيتامينات-شرب كميات وفيرة من المياه-تناول مكملات الحديد، الكالسيوم، الماغنسيوم، وكذلك الزنك، تحت إشراف الطبيب";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==39)
                  {
                    n11 = "قد يكون طول الطفل أقل أو أكثر من 50.7 سم، ويرجع ذلك لجينات الطول التي تختلف من جنين لآخر، ويتراوح وزنه ما بين 3 و3 ونصف كجم، وعادةً ما يكون الذكور أكبر وزنًا من الإناث.يزداد إفراز المادة الدهنية التي تكسو جسم صغيرك، لتحميه وتسهل من انزلاقه عبر فتحة المهبل أثناء عملية الولادة.كما يستطيع طفلك الآن التنفس من رئتيه بصورة طبيعية، ويخرج براز أسود اللون، ويستمر هكذا لبضعة أيام بعد الولادة";
                    n12 = "تبدو أعراض الحمل في ذلك الأسبوع أكثر ثقلًا من الأسابيع المنصرمة، بسبب عدم قدرة الرحم على استيعاب حجم الجنين، وأبرزها: ألم شديد أسفل الظهر-الشعور بثقل أسفل البطن-صعوبة في المشي والحركة-عدم القدرة على النوم-عدم القدرة على التنفس بشكل طبيعي-نزول قطرات الدماء من الرحم-تسرب للسائل الأمينوسي أثناء القيام بمجهود-عدم القدرة على التحكم في المثانة، والإصابة بسلس البول-قد تعانين من الإسهال بسبب اضطراب حركة الأمعاء";
                    n13 = "لا يزال جسدك بحاجة للكالسيوم، والحديد، والزنك، والماغنسيوم، للحفاظ على صحتك البدنية وتجهيز الجسد لعملية الولادة، ويمكن الحصول على هذه المعادن عن طريق الأطعمة أو المكملات الغذائية";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  else if (a==40)
                  {
                    n11 = "جنينك في أسبوعه الأخير داخل الرحم لا تطرأ عليه تغيرات أو تطورات كثيرة مقارنة بالأسابيع الماضية-قد لا يتغير وزنه أو طوله عن الأسبوع الماضي-يكتسي جسده بالطلاء الجبني، الذي يساعده على الانزلاق من فتحة المهبل أثناء الولادة-يأخذ وضع الولادة ويمكث في الحوض-تزداد حركاته، بسبب ضيق المساحة التي يجلس بها";
                    n12 = "تقلصات شديدة أسفل البطن والظهر-ثقل في البطن-تحجر البطن-زيادة الرغبة في التبول عن الأسابيع الماضية-شعور بالنشاط والرغبة في انجاز المهام سريعًا-كثرة نزول الإفرازات المدممة-انفجار الكيس المحيط بالجنين ونزول الماء منه-التوتر العصبي وزيادة القلق-عدم القدرة على النوم-صعوبة شديدة في التنفس";
                    n13 = "في تلك الأثناء، قد تضطرب شهيتك بزيادة الرغبة في تناول الطعام أو النفوره منه، بسبب التوتر النفسي المصاحب لهذه الفترة.لذلك، يجب التحلي بالهدوء والصبر، لأن الرحلة على مشارف النهاية، مع مراعاة الجمع بين الأطعمة والمكملات الغذائية، للحصول على أكبر من الفائدة";
                    n111.text = n11;
                    n112.text = n12;
                    n113.text = n13;
                  }
                  Navigator.push(context, MaterialPageRoute(builder: (context) => Details(n2.text, n111.text, n112.text, n113.text),));
                },
                child: Text(
                    "عرض التفاصيل",
                  style: TextStyle(fontSize: 20.0, fontWeight: FontWeight.w900, color: Colors.white),
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}